# PYTHON 
## Utilizando python para acessar um banco de dados relacional

### Neste tutorial, serão utilizados:
#### BANCO DE DADOS
<p>
    O banco de dados que será utilizado é o SQLite (SQLite Sample Database). Você pode obter este banco de dados de exemplo atravé do link https://www.sqlitetutorial.net/sqlite-sample-database/
</p>

### 1º Passo - Importar as bibliotecas necessárias
#### BIBLIOTECAS PYTHON
<ul>
    <li>sqlite3</li>
    <li>pandas</li>
</ul>

In [1]:
import sqlite3
import pandas as pd

### 2º Passo - Criar a variável que irá armazenar o caminho do banco de dados

In [2]:
#Armazenar o path do arquivo do nosso banco de dados
pathBD = "chinook.db"

### 3º Passo - Criar uma função para manipulação dos dados
<p>
    Através desta função, nós iremos executar comandos SQL, como SELECT, UPDATE, INSERT ou DELETE
    </p>

In [3]:
def executarComando (comando):
    
    try:        
        #criar a variável de conexão
        conexao = sqlite3.connect(pathBD)
        
        #criar objeto 'cursor', responsável pela execução do comando
        cursor = conexao.cursor()
        
        #executar o comando
        cursor.execute(comando)
        
        #efetuar o comando
        conexao.commit()
        
        #imprimir mensagem de sucesso
        print("O comando {} foi executado com sucesso!".format(comando))
        
    except sqlite3.Error as error:
        #imprimir mensagem se houver algum erro na execução
        print("Falha ao executar comando: ", error)
        
    finally:
        #fechar conexão
        if (conexao):
            conexao.close()

### 4º Passo - Função para seleção de dados 
#### Vamos criar uma função genérica para executar o comando SELECT * FROM 'Tabela':
<p>
    Nesta função, iremos utilizar a biblioteca <b>PANDAS</b> para que o retorno da função, seja um DataFrame. O DataFrame é um conjunto de Séries (um registro do DataFrame) em formato de tabela. Desta forma, com um pouco de conhecimento de 'PANDAS' é possível realizar consultas, aplicar funções de soma, média, etc nos dados extraídos entre outras infinidades de coisas :) 
</p>
<p>
    <b>Obs.:</b> <i>em um próximo artigo, vou demonstrar um tutorial básico para o uso da biblioteca 'pandas'</i>
</p>

In [4]:
def executarSelect(nome_tabela):
    try:  
        sql = "SELECT * FROM {}".format(nome_tabela)
        
        #criar a variável de conexão
        conexao = sqlite3.connect(pathBD)
        
        #acessar o banco e retornar um DataFrame 
        df = pd.read_sql_query(sql, conexao)
        
        #retornando o DataFrame
        return df
        
    except sqlite3.Error as error:
        #mostrar mensagem se houver algum erro na execução
        print("Falha ao executar comando: ", error)

## Utilizando nossas funções

<p>
    Neste ponto, já criamos as funções necessárias para trabalhar com o banco de dados:
</p>
<ul>
    <li>executarComando(): irá realizar os comandos de INSERT, DELETE ou UPDATE</li>
    <li>executarSelect(): executa o comando SELECT retornando um DataFrame</li>
</ul>
<p>
    Desta forma, vamos para aplicação prática!
</p>

<h3> <i>Função: executarSelect(nome_tabela)</i> </h3>

Realizando um SELECT na tabela <b><i>artists</i></b>

In [5]:
#armazenar o retorno da função (DataFrame) em uma variável
df_artists = executarSelect('artists')

In [6]:
#obter os 10 primeiros artistas utilizando a função head() do DataFrame
df_artists.head(10)

   ArtistId                  Name
0         1                 AC/DC
1         2                Accept
2         3             Aerosmith
3         4     Alanis Morissette
4         5       Alice In Chains
5         6  Antônio Carlos Jobim
6         7          Apocalyptica
7         8            Audioslave
8         9              BackBeat
9        10          Billy Cobham

<h3> <i>Função: executarComando(comando)</i> </h3>

#### Inserindo um registro na tabela <u><i>artists</i></u>

In [7]:
#armazenar o comando em uma variável
sql_insert = "INSERT INTO artists ('Name') VALUES ('Sepultura')"

In [8]:
#executar a função
executarComando(sql_insert)

O comando INSERT INTO artists ('Name') VALUES ('Sepultura') foi executado com sucesso!

Vamos verificar se realmente foi inserido? Então vamos realizar um select na tabela e obter a última linha!

In [9]:
#verificando se o registro foi inserido 
#executar o select
df_artists = executarSelect('artists')
#obter a última linha da tabela com a função tail() do DataFrame
df_artists.tail(1)

     ArtistId       Name
275       276  Sepultura

#### Excluindo um registro na tabela <u><i>artists</i></u>

Vou excluir o artista com o nome de <b><i>Sepultura<i><b> (ArtistId = 276) neste exemplo:

In [10]:
#armazenar o comando em uma variável
sql_delete = "DELETE FROM artists WHERE ArtistId = 276"

In [11]:
#executar a função
executarComando(sql_delete)

O comando DELETE FROM artists WHERE ArtistId = 276 foi executado com sucesso!

Agora vamos verificar se o registro foi realmente excluído. O artista <b><i>Sepultura</i></b> não deverá estar mais na tabela.

In [12]:
#verificando se o registro foi inserido 
#executar o select
df_artists = executarSelect('artists')
#obter as ultimas 5 linhas da tabela
df_artists.tail(5)

     ArtistId                                               Name
270       271   Mela Tenenbaum, Pro Musica Prague & Richard Kapp
271       272                             Emerson String Quartet
272       273  C. Monteverdi, Nigel Rogers - Chiaroscuro; Lon...
273       274                                      Nash Ensemble
274       275                              Philip Glass Ensemble

#### E por último, vamos aplicar uma atualização em um registro na tabela <u><i>artists</i></u>

Vamos deixar o nome do artista <b><i>Audioslave<i><b> (ArtistId = 8) em CAIXA ALTA:

In [13]:
#armazenar o comando em uma variável
sql_update = "UPDATE artists SET Name = 'AUDIOSLAVE' WHERE ArtistId = 8"

In [14]:
#executar a função
executarComando(sql_update)

O comando UPDATE artists SET Name = 'AUDIOSLAVE' WHERE ArtistId = 8 foi executado com sucesso!

In [15]:
#verificando se o registro foi atualizado
#executar o select
df_artists = executarSelect('artists')
#obter as primeiras 10 linhas da tabela
df_artists.head(10)

   ArtistId                  Name
0         1                 AC/DC
1         2                Accept
2         3             Aerosmith
3         4     Alanis Morissette
4         5       Alice In Chains
5         6  Antônio Carlos Jobim
6         7          Apocalyptica
7         8            AUDIOSLAVE
8         9              BackBeat
9        10          Billy Cobham